%created by liang
%2019.11.30
%*********
%***

%*///*///
%例6.10 利用连接点实施图像几何校正复原
f = imread('H:/coin.jpg');          %读取原图像
figure(1),imshow(f);                %显示原图像
g = imread('H:/coin.jpg')           %读取几何失真图像
figure(2);imshow(g);                %显示几何失真图像
%利用cpsplect(g,f)交换如下选择的9对连接点
base_points = [61.7500 99.2500;36.7500 149.25200;
    86.7500 148.7500; 128.2500  109.2500;
    168.7500  156.7500;  166.2500 117.7500;
    211.7500 91.7500;212.2500 133.2500;
    211.7500 173.2500];                 %从f中选择的9个连接点的坐标矩阵
input_points = [117.7500 98.7500; 110.2500 148.2500;
    162.7500 148.7500; 184.7500 108.7500;
    251.7500 159.7500; 224.2500 117.2500;
    258.2500 91.7500; 279.7500 133.7500;
    299.7500 173.7500];                     %从g中选择的9个连接点的坐标矩阵
tform = cp2tform(input_points,base_points,'projective');
                                            %由9对连接点的坐标矩阵建立几何变换结构
gp = imtransform(g,tform,'XData',[1 256],'YData',[1 256]);
                                            %由得到的几何变换结构对失真图像g进行校正
figure(3);imshow(gp);             %显示校正后的图像
