%created by liang
%2019.12.1
%*********
%***

%*///*///
%例9.1 生成一幅图像，左上角红色，左下角蓝色，右上角为绿色，右下角为黑色
clear
rgb_R = zeros(128,128);             %生成一幅128x128的零矩阵，作为R分量
rgb_R(1:64,1:64) = 1;            %左上角的64x64设置为1
rgb_G = zeros(128,128);             %生成一幅128x128的零矩阵，作为G分量
rgb_G(1:64,65:128) = 1;          %右上角的64x64设置为1
rgb_B = zeros(128,128);             %生成一幅128x128的零矩阵，作为B分量
rgb_B(65:128,1:64) = 1;          %左下角的64x64设置为1
rgb = cat(3,rgb_R,rgb_G,rgb_B);       %使用cat函数将三个分量组合
figure,imshow(rgb),title('RGB彩色图像');