%created by liang
%2019.12.1
%*********
%***

%*///*///
%例9.6 彩色平衡
clear
im = double(imread('H:/coin.jpg'));         %读取图像
[m,n,p] = size(im);                         %得到图像的大小
F1 = im(1,1,:);                             %选取第一个彩色点，坐标为(1,1)
F2 = im(1,2,:);                             %选取第二个彩色点，坐标为(1,2)
F1_(1,1,1) = F1(:,:,2);                     %将第一个点的绿色值赋给F1_红分量
F1_(1,1,2) = F1(:,:,2);                     %将第一个点的绿色值赋给F1_绿分量
F1_(1,1,3) = F1(:,:,2);                     %将第一个点的绿色值赋给F1_蓝分量
F2_(1,1,1) = F2(:,:,2);                     %将第二个点的绿色值赋给F1_红分量
F2_(1,1,2) = F2(:,:,2);                     %将第二个点的绿色值赋给F1_绿分量
F2_(1,1,3) = F2(:,:,2);                     %将第二个点的绿色值赋给F1_蓝分量
K1 = (F1_(1,1,1)-F2_(1,1,1))/(F1(1,1,1)-F2(1,1,1));%计算R分量的线性变换系数K1
K2 = F1_(1,1,1)-K1*F1(1,1,1);               %计算R分量的线性变换系数K2
L1 = (F1_(1,1,3)-F2_(1,1,3))/(F1(1,1,3)-F2(1,1,3));
                                            %计算得到B分量线性变换系数L1
L2 = F1_(1,1,3)-L1*F1(1,1,3);               %计算得到B分量线性变换系数L2
for i=1:m
    for j=1:n
        new(i,j,1) = K1*im(i,j,1)+K2;       %R分量线性变换
        new(i,j,2) = im(i,j,2);             %G分量线性变换
        new(i,j,3) = L1*im(i,j,3)+L2;       %B分量线性变换
    end
end
im = uint8(im);                              %原图转换成uint8类型
new = uint8(new);                           %结果转换成uint8类型
figure,imshow(im);                          %显示原图
figure,imshow(new)                          %显示结果图
